; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	image2 - mode
	infrared4 - mode
	infrared1 - mode
	spectrograph3 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 105)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared4)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared1)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 149)
	(supports instrument4 infrared4)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 170)
	(supports instrument7 infrared1)
	(supports instrument7 image2)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star2)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 spectrograph3)
	(supports instrument9 infrared1)
	(supports instrument9 infrared4)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 101)
	(supports instrument10 spectrograph3)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 image0)
	(calibration_target instrument11 Star2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet7)
	(= (data_capacity satellite4) 1000)
	(= (fuel satellite4) 115)
	(= (data Star3 image2) 130)
	(= (data Phenomenon4 image2) 256)
	(= (data Phenomenon5 image2) 152)
	(= (data Phenomenon6 image2) 234)
	(= (data Planet7 image2) 196)
	(= (data Star8 image2) 178)
	(= (data Phenomenon9 image2) 174)
	(= (data Star10 image2) 155)
	(= (data Phenomenon11 image2) 25)
	(= (data Planet12 image2) 115)
	(= (data Star13 image2) 257)
	(= (data Star3 infrared4) 267)
	(= (data Phenomenon4 infrared4) 292)
	(= (data Phenomenon5 infrared4) 224)
	(= (data Phenomenon6 infrared4) 218)
	(= (data Planet7 infrared4) 88)
	(= (data Star8 infrared4) 143)
	(= (data Phenomenon9 infrared4) 271)
	(= (data Star10 infrared4) 298)
	(= (data Phenomenon11 infrared4) 77)
	(= (data Planet12 infrared4) 82)
	(= (data Star13 infrared4) 297)
	(= (data Star3 infrared1) 10)
	(= (data Phenomenon4 infrared1) 264)
	(= (data Phenomenon5 infrared1) 110)
	(= (data Phenomenon6 infrared1) 154)
	(= (data Planet7 infrared1) 208)
	(= (data Star8 infrared1) 244)
	(= (data Phenomenon9 infrared1) 201)
	(= (data Star10 infrared1) 124)
	(= (data Phenomenon11 infrared1) 79)
	(= (data Planet12 infrared1) 85)
	(= (data Star13 infrared1) 26)
	(= (data Star3 spectrograph3) 247)
	(= (data Phenomenon4 spectrograph3) 146)
	(= (data Phenomenon5 spectrograph3) 200)
	(= (data Phenomenon6 spectrograph3) 252)
	(= (data Planet7 spectrograph3) 293)
	(= (data Star8 spectrograph3) 117)
	(= (data Phenomenon9 spectrograph3) 16)
	(= (data Star10 spectrograph3) 172)
	(= (data Phenomenon11 spectrograph3) 156)
	(= (data Planet12 spectrograph3) 281)
	(= (data Star13 spectrograph3) 118)
	(= (data Star3 image0) 91)
	(= (data Phenomenon4 image0) 90)
	(= (data Phenomenon5 image0) 161)
	(= (data Phenomenon6 image0) 161)
	(= (data Planet7 image0) 24)
	(= (data Star8 image0) 70)
	(= (data Phenomenon9 image0) 95)
	(= (data Star10 image0) 272)
	(= (data Phenomenon11 image0) 284)
	(= (data Planet12 image0) 87)
	(= (data Star13 image0) 112)
	(= (slew_time GroundStation1 GroundStation0) 34.1)
	(= (slew_time GroundStation0 GroundStation1) 34.1)
	(= (slew_time Star2 GroundStation0) 26.28)
	(= (slew_time GroundStation0 Star2) 26.28)
	(= (slew_time Star2 GroundStation1) 20.48)
	(= (slew_time GroundStation1 Star2) 20.48)
	(= (slew_time Star3 GroundStation0) 62.59)
	(= (slew_time GroundStation0 Star3) 62.59)
	(= (slew_time Star3 GroundStation1) 45.09)
	(= (slew_time GroundStation1 Star3) 45.09)
	(= (slew_time Star3 Star2) 64.56)
	(= (slew_time Star2 Star3) 64.56)
	(= (slew_time Phenomenon4 GroundStation0) 0.03618)
	(= (slew_time GroundStation0 Phenomenon4) 0.03618)
	(= (slew_time Phenomenon4 GroundStation1) 14.99)
	(= (slew_time GroundStation1 Phenomenon4) 14.99)
	(= (slew_time Phenomenon4 Star2) 35.71)
	(= (slew_time Star2 Phenomenon4) 35.71)
	(= (slew_time Phenomenon4 Star3) 8.026)
	(= (slew_time Star3 Phenomenon4) 8.026)
	(= (slew_time Phenomenon5 GroundStation0) 32.5)
	(= (slew_time GroundStation0 Phenomenon5) 32.5)
	(= (slew_time Phenomenon5 GroundStation1) 54.52)
	(= (slew_time GroundStation1 Phenomenon5) 54.52)
	(= (slew_time Phenomenon5 Star2) 18.27)
	(= (slew_time Star2 Phenomenon5) 18.27)
	(= (slew_time Phenomenon5 Star3) 4.637)
	(= (slew_time Star3 Phenomenon5) 4.637)
	(= (slew_time Phenomenon5 Phenomenon4) 43.87)
	(= (slew_time Phenomenon4 Phenomenon5) 43.87)
	(= (slew_time Phenomenon6 GroundStation0) 40.42)
	(= (slew_time GroundStation0 Phenomenon6) 40.42)
	(= (slew_time Phenomenon6 GroundStation1) 4.425)
	(= (slew_time GroundStation1 Phenomenon6) 4.425)
	(= (slew_time Phenomenon6 Star2) 31.13)
	(= (slew_time Star2 Phenomenon6) 31.13)
	(= (slew_time Phenomenon6 Star3) 47.68)
	(= (slew_time Star3 Phenomenon6) 47.68)
	(= (slew_time Phenomenon6 Phenomenon4) 89.5)
	(= (slew_time Phenomenon4 Phenomenon6) 89.5)
	(= (slew_time Phenomenon6 Phenomenon5) 75.67)
	(= (slew_time Phenomenon5 Phenomenon6) 75.67)
	(= (slew_time Planet7 GroundStation0) 25.57)
	(= (slew_time GroundStation0 Planet7) 25.57)
	(= (slew_time Planet7 GroundStation1) 53.71)
	(= (slew_time GroundStation1 Planet7) 53.71)
	(= (slew_time Planet7 Star2) 50.28)
	(= (slew_time Star2 Planet7) 50.28)
	(= (slew_time Planet7 Star3) 63.47)
	(= (slew_time Star3 Planet7) 63.47)
	(= (slew_time Planet7 Phenomenon4) 55.21)
	(= (slew_time Phenomenon4 Planet7) 55.21)
	(= (slew_time Planet7 Phenomenon5) 6.536)
	(= (slew_time Phenomenon5 Planet7) 6.536)
	(= (slew_time Planet7 Phenomenon6) 37.44)
	(= (slew_time Phenomenon6 Planet7) 37.44)
	(= (slew_time Star8 GroundStation0) 11.65)
	(= (slew_time GroundStation0 Star8) 11.65)
	(= (slew_time Star8 GroundStation1) 14.59)
	(= (slew_time GroundStation1 Star8) 14.59)
	(= (slew_time Star8 Star2) 16.9)
	(= (slew_time Star2 Star8) 16.9)
	(= (slew_time Star8 Star3) 1.921)
	(= (slew_time Star3 Star8) 1.921)
	(= (slew_time Star8 Phenomenon4) 34.16)
	(= (slew_time Phenomenon4 Star8) 34.16)
	(= (slew_time Star8 Phenomenon5) 7.423)
	(= (slew_time Phenomenon5 Star8) 7.423)
	(= (slew_time Star8 Phenomenon6) 32.17)
	(= (slew_time Phenomenon6 Star8) 32.17)
	(= (slew_time Star8 Planet7) 78.67)
	(= (slew_time Planet7 Star8) 78.67)
	(= (slew_time Phenomenon9 GroundStation0) 36.1)
	(= (slew_time GroundStation0 Phenomenon9) 36.1)
	(= (slew_time Phenomenon9 GroundStation1) 59.26)
	(= (slew_time GroundStation1 Phenomenon9) 59.26)
	(= (slew_time Phenomenon9 Star2) 1.436)
	(= (slew_time Star2 Phenomenon9) 1.436)
	(= (slew_time Phenomenon9 Star3) 20.02)
	(= (slew_time Star3 Phenomenon9) 20.02)
	(= (slew_time Phenomenon9 Phenomenon4) 19.44)
	(= (slew_time Phenomenon4 Phenomenon9) 19.44)
	(= (slew_time Phenomenon9 Phenomenon5) 40.87)
	(= (slew_time Phenomenon5 Phenomenon9) 40.87)
	(= (slew_time Phenomenon9 Phenomenon6) 12.59)
	(= (slew_time Phenomenon6 Phenomenon9) 12.59)
	(= (slew_time Phenomenon9 Planet7) 23.32)
	(= (slew_time Planet7 Phenomenon9) 23.32)
	(= (slew_time Phenomenon9 Star8) 2.013)
	(= (slew_time Star8 Phenomenon9) 2.013)
	(= (slew_time Star10 GroundStation0) 25.12)
	(= (slew_time GroundStation0 Star10) 25.12)
	(= (slew_time Star10 GroundStation1) 57.78)
	(= (slew_time GroundStation1 Star10) 57.78)
	(= (slew_time Star10 Star2) 0.6354)
	(= (slew_time Star2 Star10) 0.6354)
	(= (slew_time Star10 Star3) 47.44)
	(= (slew_time Star3 Star10) 47.44)
	(= (slew_time Star10 Phenomenon4) 29.14)
	(= (slew_time Phenomenon4 Star10) 29.14)
	(= (slew_time Star10 Phenomenon5) 48.94)
	(= (slew_time Phenomenon5 Star10) 48.94)
	(= (slew_time Star10 Phenomenon6) 0.9056)
	(= (slew_time Phenomenon6 Star10) 0.9056)
	(= (slew_time Star10 Planet7) 27.79)
	(= (slew_time Planet7 Star10) 27.79)
	(= (slew_time Star10 Star8) 25.69)
	(= (slew_time Star8 Star10) 25.69)
	(= (slew_time Star10 Phenomenon9) 11.57)
	(= (slew_time Phenomenon9 Star10) 11.57)
	(= (slew_time Phenomenon11 GroundStation0) 9.277)
	(= (slew_time GroundStation0 Phenomenon11) 9.277)
	(= (slew_time Phenomenon11 GroundStation1) 17.53)
	(= (slew_time GroundStation1 Phenomenon11) 17.53)
	(= (slew_time Phenomenon11 Star2) 51.19)
	(= (slew_time Star2 Phenomenon11) 51.19)
	(= (slew_time Phenomenon11 Star3) 44.11)
	(= (slew_time Star3 Phenomenon11) 44.11)
	(= (slew_time Phenomenon11 Phenomenon4) 18.08)
	(= (slew_time Phenomenon4 Phenomenon11) 18.08)
	(= (slew_time Phenomenon11 Phenomenon5) 5.651)
	(= (slew_time Phenomenon5 Phenomenon11) 5.651)
	(= (slew_time Phenomenon11 Phenomenon6) 26.21)
	(= (slew_time Phenomenon6 Phenomenon11) 26.21)
	(= (slew_time Phenomenon11 Planet7) 0.4544)
	(= (slew_time Planet7 Phenomenon11) 0.4544)
	(= (slew_time Phenomenon11 Star8) 20.35)
	(= (slew_time Star8 Phenomenon11) 20.35)
	(= (slew_time Phenomenon11 Phenomenon9) 62.25)
	(= (slew_time Phenomenon9 Phenomenon11) 62.25)
	(= (slew_time Phenomenon11 Star10) 0.6308)
	(= (slew_time Star10 Phenomenon11) 0.6308)
	(= (slew_time Planet12 GroundStation0) 34.16)
	(= (slew_time GroundStation0 Planet12) 34.16)
	(= (slew_time Planet12 GroundStation1) 21.78)
	(= (slew_time GroundStation1 Planet12) 21.78)
	(= (slew_time Planet12 Star2) 13.59)
	(= (slew_time Star2 Planet12) 13.59)
	(= (slew_time Planet12 Star3) 54.69)
	(= (slew_time Star3 Planet12) 54.69)
	(= (slew_time Planet12 Phenomenon4) 10.51)
	(= (slew_time Phenomenon4 Planet12) 10.51)
	(= (slew_time Planet12 Phenomenon5) 4.243)
	(= (slew_time Phenomenon5 Planet12) 4.243)
	(= (slew_time Planet12 Phenomenon6) 43.95)
	(= (slew_time Phenomenon6 Planet12) 43.95)
	(= (slew_time Planet12 Planet7) 10.51)
	(= (slew_time Planet7 Planet12) 10.51)
	(= (slew_time Planet12 Star8) 8.674)
	(= (slew_time Star8 Planet12) 8.674)
	(= (slew_time Planet12 Phenomenon9) 6.236)
	(= (slew_time Phenomenon9 Planet12) 6.236)
	(= (slew_time Planet12 Star10) 76.65)
	(= (slew_time Star10 Planet12) 76.65)
	(= (slew_time Planet12 Phenomenon11) 18.52)
	(= (slew_time Phenomenon11 Planet12) 18.52)
	(= (slew_time Star13 GroundStation0) 77.04)
	(= (slew_time GroundStation0 Star13) 77.04)
	(= (slew_time Star13 GroundStation1) 88.2)
	(= (slew_time GroundStation1 Star13) 88.2)
	(= (slew_time Star13 Star2) 31.46)
	(= (slew_time Star2 Star13) 31.46)
	(= (slew_time Star13 Star3) 79.97)
	(= (slew_time Star3 Star13) 79.97)
	(= (slew_time Star13 Phenomenon4) 74.07)
	(= (slew_time Phenomenon4 Star13) 74.07)
	(= (slew_time Star13 Phenomenon5) 17.35)
	(= (slew_time Phenomenon5 Star13) 17.35)
	(= (slew_time Star13 Phenomenon6) 0.5412)
	(= (slew_time Phenomenon6 Star13) 0.5412)
	(= (slew_time Star13 Planet7) 28.94)
	(= (slew_time Planet7 Star13) 28.94)
	(= (slew_time Star13 Star8) 67.57)
	(= (slew_time Star8 Star13) 67.57)
	(= (slew_time Star13 Phenomenon9) 46.6)
	(= (slew_time Phenomenon9 Star13) 46.6)
	(= (slew_time Star13 Star10) 59.02)
	(= (slew_time Star10 Star13) 59.02)
	(= (slew_time Star13 Phenomenon11) 28.56)
	(= (slew_time Phenomenon11 Star13) 28.56)
	(= (slew_time Star13 Planet12) 13.03)
	(= (slew_time Planet12 Star13) 13.03)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Star3 infrared4)
	(have_image Phenomenon4 image0)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 infrared4)
	(have_image Planet7 image0)
	(have_image Star8 infrared4)
	(have_image Phenomenon9 spectrograph3)
	(have_image Star10 infrared1)
	(have_image Phenomenon11 infrared4)
	(have_image Planet12 image2)
	(have_image Star13 image0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 star2 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star2)
   changed: (fuel satellite3) from 101 to 80.52, (fuel-used) from 0 to 20.48
   goals met: 1 of 12
2. (turn_to satellite0 phenomenon5 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 105 to 56.06, (fuel-used) from 20.48 to 69.42
   goals met: 1 of 12
3. (turn_to satellite1 groundstation0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 149 to 86.41, (fuel-used) from 69.42 to 132.01
   goals met: 0 of 12
4. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 12
5. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
6. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 12
7. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 86.41 to 23.82, (fuel-used) from 132.01 to 194.6
   goals met: 1 of 12
8. (take_image satellite1 star3 instrument1 infrared4)
   added: (have_image star3 infrared4)
   changed: (data_capacity satellite1) from 1000 to 733, (data-stored) from 0 to 267
   goals met: 2 of 12
9. (switch_off instrument9 satellite3)
   deleted: (power_on instrument9)
   added: (power_avail satellite3)
   goals met: 2 of 12
10. (turn_to satellite4 star10 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star10)
   changed: (fuel satellite4) from 115 to 87.21, (fuel-used) from 194.6 to 222.39
   goals met: 2 of 12
11. (turn_to satellite4 star2 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star2)
   changed: (fuel satellite4) from 87.21 to 86.5746, (fuel-used) from 222.39 to 223.025
   goals met: 2 of 12
12. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 2 of 12
13. (calibrate satellite4 instrument11 star2)
   added: (calibrated instrument11)
   goals met: 2 of 12
14. (turn_to satellite4 star13 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 star13)
   changed: (fuel satellite4) from 86.5746 to 55.1146, (fuel-used) from 223.025 to 254.485
   goals met: 2 of 12
15. (take_image satellite4 star13 instrument11 image0)
   added: (have_image star13 image0)
   changed: (data_capacity satellite4) from 1000 to 888, (data-stored) from 267 to 379
   goals met: 3 of 12
16. (turn_to satellite4 planet7 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 planet7)
   changed: (fuel satellite4) from 55.1146 to 26.1746, (fuel-used) from 254.485 to 283.425
   goals met: 3 of 12
17. (take_image satellite4 planet7 instrument11 image0)
   added: (have_image planet7 image0)
   changed: (data_capacity satellite4) from 888 to 864, (data-stored) from 379 to 403
   goals met: 4 of 12
18. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 4 of 12
19. (calibrate satellite3 instrument9 star2)
   added: (calibrated instrument9)
   goals met: 4 of 12
20. (turn_to satellite3 phenomenon6 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon6)
   changed: (fuel satellite3) from 80.52 to 49.39, (fuel-used) from 283.425 to 314.555
   goals met: 4 of 12
21. (take_image satellite3 phenomenon6 instrument9 infrared4)
   added: (have_image phenomenon6 infrared4)
   changed: (data_capacity satellite3) from 1000 to 782, (data-stored) from 403 to 621
   goals met: 5 of 12
22. (switch_off instrument9 satellite3)
   deleted: (power_on instrument9)
   added: (power_avail satellite3)
   goals met: 5 of 12
23. (turn_to satellite3 star2 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star2)
   changed: (fuel satellite3) from 49.39 to 18.26, (fuel-used) from 314.555 to 345.685
   goals met: 5 of 12
24. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 12
25. (switch_on instrument9 satellite3)
   deleted: (calibrated instrument9) (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 5 of 12
26. (turn_to satellite1 phenomenon4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 23.82 to 15.794, (fuel-used) from 345.685 to 353.711
   goals met: 4 of 12
27. (take_image satellite1 phenomenon4 instrument1 image0)
   added: (have_image phenomenon4 image0)
   changed: (data_capacity satellite1) from 733 to 643, (data-stored) from 621 to 711
   goals met: 5 of 12
28. (turn_to satellite1 star3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 15.794 to 7.768, (fuel-used) from 353.711 to 361.737
   goals met: 6 of 12
29. (turn_to satellite1 star8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 7.768 to 5.847, (fuel-used) from 361.737 to 363.658
   goals met: 5 of 12
30. (take_image satellite1 star8 instrument1 infrared4)
   added: (have_image star8 infrared4)
   changed: (data_capacity satellite1) from 643 to 500, (data-stored) from 711 to 854
   goals met: 6 of 12
31. (switch_off instrument9 satellite3)
   deleted: (power_on instrument9)
   added: (power_avail satellite3)
   goals met: 6 of 12
32. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 5.847 to 3.926, (fuel-used) from 363.658 to 365.579
   goals met: 7 of 12
33. (turn_to satellite3 phenomenon9 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon9)
   changed: (fuel satellite3) from 18.26 to 16.824, (fuel-used) from 365.579 to 367.015
   goals met: 7 of 12
34. (turn_to satellite3 star10 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 16.824 to 5.254, (fuel-used) from 367.015 to 378.585
   goals met: 7 of 12
35. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 7 of 12
36. (turn_to satellite3 star2 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star2)
   changed: (fuel satellite3) from 5.254 to 4.6186, (fuel-used) from 378.585 to 379.221
   goals met: 7 of 12
37. (calibrate satellite3 instrument9 star2)
   added: (calibrated instrument9)
   goals met: 7 of 12
38. (turn_to satellite3 star10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 4.6186 to 3.9832, (fuel-used) from 379.221 to 379.856
   goals met: 7 of 12
39. (turn_to satellite3 phenomenon11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon11)
   changed: (fuel satellite3) from 3.9832 to 3.3524, (fuel-used) from 379.856 to 380.487
   goals met: 7 of 12
40. (take_image satellite3 phenomenon11 instrument9 infrared4)
   added: (have_image phenomenon11 infrared4)
   changed: (data_capacity satellite3) from 782 to 705, (data-stored) from 854 to 931
   goals met: 8 of 12
41. (turn_to satellite3 star10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 3.3524 to 2.7216, (fuel-used) from 380.487 to 381.118
   goals met: 8 of 12
42. (take_image satellite3 star10 instrument9 infrared1)
   added: (have_image star10 infrared1)
   changed: (data_capacity satellite3) from 705 to 581, (data-stored) from 931 to 1055
   goals met: 9 of 12
43. (switch_off instrument9 satellite3)
   deleted: (power_on instrument9)
   added: (power_avail satellite3)
   goals met: 9 of 12
44. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 9 of 12
45. (turn_to satellite3 star2 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star2)
   changed: (fuel satellite3) from 2.7216 to 2.0862, (fuel-used) from 381.118 to 381.753
   goals met: 9 of 12
46. (turn_to satellite0 planet12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet12)
   changed: (fuel satellite0) from 56.06 to 51.817, (fuel-used) from 381.753 to 385.996
   goals met: 9 of 12
47. (turn_to satellite0 phenomenon5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 51.817 to 47.574, (fuel-used) from 385.996 to 390.239
   goals met: 9 of 12
48. (turn_to satellite0 planet12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet12)
   changed: (fuel satellite0) from 47.574 to 43.331, (fuel-used) from 390.239 to 394.482
   goals met: 9 of 12
49. (calibrate satellite3 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 9 of 12
50. (turn_to satellite0 phenomenon5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 43.331 to 39.088, (fuel-used) from 394.482 to 398.725
   goals met: 9 of 12
51. (switch_off instrument7 satellite3)
   deleted: (power_on instrument7)
   added: (power_avail satellite3)
   goals met: 9 of 12
52. (switch_on instrument9 satellite3)
   deleted: (calibrated instrument9) (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 9 of 12
53. (turn_to satellite0 planet12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet12)
   changed: (fuel satellite0) from 39.088 to 34.845, (fuel-used) from 398.725 to 402.968
   goals met: 9 of 12
54. (calibrate satellite3 instrument9 star2)
   added: (calibrated instrument9)
   goals met: 9 of 12
55. (turn_to satellite3 phenomenon9 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon9)
   changed: (fuel satellite3) from 2.0862 to 0.6502, (fuel-used) from 402.968 to 404.404
   goals met: 9 of 12
56. (take_image satellite3 phenomenon9 instrument9 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   changed: (data_capacity satellite3) from 581 to 565, (data-stored) from 1055 to 1071
   goals met: 10 of 12
57. (turn_to satellite0 star2 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 34.845 to 21.255, (fuel-used) from 404.404 to 417.994
   goals met: 10 of 12
58. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 10 of 12
59. (turn_to satellite0 planet12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet12)
   changed: (fuel satellite0) from 21.255 to 7.665, (fuel-used) from 417.994 to 431.584
   goals met: 10 of 12
60. (take_image satellite0 planet12 instrument0 image2)
   added: (have_image planet12 image2)
   changed: (data_capacity satellite0) from 1000 to 885, (data-stored) from 1071 to 1186
   goals met: 11 of 12
61. (turn_to satellite0 phenomenon5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 7.665 to 3.422, (fuel-used) from 431.584 to 435.827
   goals met: 11 of 12
62. (take_image satellite0 phenomenon5 instrument0 image2)
   added: (have_image phenomenon5 image2)
   changed: (data_capacity satellite0) from 885 to 733, (data-stored) from 1186 to 1338
   goals met: 12 of 12
